- create dataframe using list
- create dataframe using dict
- add extra col
- update col
- change index
- drop
- save dataframe

- shape

### eda packagess

- pandas : data frame applications
- numpy : numerical python (all math applications)
- matplotlib : plotting
- seaborn : plot
- plotly : plot
- bokhe : plot

### machine learning

- sickit-learn : sklearn

### deep learning

- tensorflow : google
- keras : google
- pytorch : facebook

### NLP

- nltk : natural language tool kit
- scipy

### create dataframe using list

In [1]:
import pandas as pd
names=["Rajasri","Sunny","Priya"]
pd.DataFrame() # no rows and columns

Empty DataFrame
Columns: []
Index: []

In [2]:
names=["Rajasri","Hema","Sunny","Priya"]
pd.DataFrame(names)

         0
0  Rajasri
1     Hema
2    Sunny
3    Priya

In [3]:
names=["Rajasri","Hema","Sunny","Priya"]
age=[20,23,24,26]
pd.DataFrame(names,age)

          0
20  Rajasri
23     Hema
24    Sunny
26    Priya

In [4]:
names=["Rajasri","Hema","Sunny","Priya"]
age=[20,23,24,26]
pd.DataFrame(age,names)

          0
Rajasri  20
Hema     23
Sunny    24
Priya    26

- zip

In [5]:
names=["Rajasri","Hema","Sunny","Priya"]
age=[20,23,24,26]
pd.DataFrame(zip(names,age))

         0   1
0  Rajasri  20
1     Hema  23
2    Sunny  24
3    Priya  26

In [6]:
names=["Rajasri","Hema","Sunny","Priya"]
age=[20,23,24,26]
group=["cse","it","cse","it"]
pd.DataFrame(zip(names,age,group))

         0   1    2
0  Rajasri  20  cse
1     Hema  23   it
2    Sunny  24  cse
3    Priya  26   it

In [7]:
names=["Rajasri","Hema","Sunny","Priya"]
age=[20,23,24,26]
group=["cse","it","cse","it"]
pd.DataFrame(zip(names,age),group)

           0   1
cse  Rajasri  20
it      Hema  23
cse    Sunny  24
it     Priya  26

- column names

In [10]:
names=["Rajasri","Hema","Sunny","Priya"]
age=[20,23,24,26]
group=["cse","it","cse","it"]
pd.DataFrame(zip(names,age,group),["name","age","group","city"])

             0   1    2
name   Rajasri  20  cse
age       Hema  23   it
group    Sunny  24  cse
city     Priya  26   it

In [11]:
names=["Rajasri","Hema","Sunny","Priya"]
age=[20,23,24,26]
group=["cse","it","cse","it"]
pd.DataFrame(zip(names,age,group),columns=["name","age","group"])

      name  age group
0  Rajasri   20   cse
1     Hema   23    it
2    Sunny   24   cse
3    Priya   26    it

In [12]:
names=["Rajasri","Hema","Sunny","Priya"]
age=[20,23,24,26]
group=["cse","it","cse","it"]
cols=["name","age","group"]
pd.DataFrame(zip(names,age,group),columns=cols)

      name  age group
0  Rajasri   20   cse
1     Hema   23    it
2    Sunny   24   cse
3    Priya   26    it

In [13]:
names=["Rajasri","Hema","Sunny","Priya"]
age=[20,23,24,26]
group=["cse","it","cse","it"]
cols=["name","age","group"]
df=pd.DataFrame(zip(names,age,group),columns=cols)

In [14]:
# names=["Rajasri","Hema","Sunny","Priya"]
# age=[20,23,24,26]
# group=["cse","it","cse","it"]
# cols=["name","age","group"]
# df=pd.DataFrame(zip(names,age,group),columns=cols)

# job=["se","ds","qa","cs"]
# df['job']=job

# city=["hyd","blr","delhi","pune"]
# df['city']=city

### type

In [15]:
type(df)

pandas.core.frame.DataFrame

### add extra columns

In [21]:
job=["se","ds","qa","cs"]
df['job']=job
df

      name  age group   city job
0  Rajasri   23   cse    hyd  se
1     Hema   22    it    blr  ds
2    Sunny   25   cse  delhi  qa
3    Priya   21    it   pune  cs

In [23]:
city=["hyd","blr","delhi","pune"]
df['city']=city
df

      name  age group   city job
0  Rajasri   23   cse    hyd  se
1     Hema   22    it    blr  ds
2    Sunny   25   cse  delhi  qa
3    Priya   21    it   pune  cs

### update existed column

In [24]:
df['age']=[23,22,25,21]
df

      name  age group   city job
0  Rajasri   23   cse    hyd  se
1     Hema   22    it    blr  ds
2    Sunny   25   cse  delhi  qa
3    Priya   21    it   pune  cs

### change index

In [25]:
names=["Rajasri","Hema","Sunny","Priya"]
age=[20,23,24,26]
group=["cse","it","cse","it"]
pd.DataFrame(zip(names,age,group),index=["a","b","c","d"],columns=["name","age","group"])

      name  age group
a  Rajasri   20   cse
b     Hema   23    it
c    Sunny   24   cse
d    Priya   26    it

### shape no of rows, columns

In [26]:
df.shape

(4, 5)

### drop columns

- name
- axis
  - axis 0 - rows
  - axis 1 - col
- drop can be in same var or diff
  - inplace - True
  - inplace - False

In [27]:
df

      name  age group   city job
0  Rajasri   23   cse    hyd  se
1     Hema   22    it    blr  ds
2    Sunny   25   cse  delhi  qa
3    Priya   21    it   pune  cs

In [28]:
df.drop(4,axis=1,inplace=True)
df

KeyError: '[4] not found in axis'

In [29]:
df.drop("job",axis=1,inplace=True)
df

      name  age group   city
0  Rajasri   23   cse    hyd
1     Hema   22    it    blr
2    Sunny   25   cse  delhi
3    Priya   21    it   pune

In [21]:
df1=df.drop("city",axis=1)

In [22]:
df1

      name  age group
0  Rajasri   23   cse
1     Hema   22    it
2    Sunny   25   cse
3    Priya   21    it

In [23]:
df

      name  age group   city
0  Rajasri   23   cse    hyd
1     Hema   22    it    blr
2    Sunny   25   cse  delhi
3    Priya   21    it   pune

- del multiple colums

In [31]:
names=["Rajasri","Hema","Sunny","Priya"]
age=[20,23,24,26]
group=["cse","it","cse","it"]
cols=["name","age","group"]
df=pd.DataFrame(zip(names,age,group),columns=cols)

job=["se","ds","qa","cs"]
df['job']=job

city=["hyd","blr","delhi","pune"]
df['city']=city

In [35]:
df

      name  age group job   city
0  Rajasri   20   cse  se    hyd
1     Hema   23    it  ds    blr
2    Sunny   24   cse  qa  delhi
3    Priya   26    it  cs   pune

- drop multiple columns

In [36]:
df.drop(['city','job'],axis=1)

      name  age group
0  Rajasri   20   cse
1     Hema   23    it
2    Sunny   24   cse
3    Priya   26    it

In [32]:
df

      name  age group job   city
0  Rajasri   20   cse  se    hyd
1     Hema   23    it  ds    blr
2    Sunny   24   cse  qa  delhi
3    Priya   26    it  cs   pune

- drop rows

In [38]:
df.drop(3)

      name  age group job   city
0  Rajasri   20   cse  se    hyd
1     Hema   23    it  ds    blr
2    Sunny   24   cse  qa  delhi

In [30]:
df

      name  age group   city
0  Rajasri   23   cse    hyd
1     Hema   22    it    blr
2    Sunny   25   cse  delhi
3    Priya   21    it   pune

- how to save in local

In [40]:
df # actual one

      name  age group job   city
0  Rajasri   20   cse  se    hyd
1     Hema   23    it  ds    blr
2    Sunny   24   cse  qa  delhi
3    Priya   26    it  cs   pune

### saving

- generally df are 2 types
  - csv
  - excel

In [115]:
df.to_csv("data.csv")

- no index

In [116]:
df.to_csv("data1.csv",index=False)

In [118]:
df.to_excel("data1.xlsx",index=False)

In [4]:
names=["Rajasri","Hema","Sunny","Priya"]
age=[20,23,24,26]
group=["cse","it","cse","it"]
d=pd.DataFrame(zip(names,age,group))
d

         0   1    2
0  Rajasri  20  cse
1     Hema  23   it
2    Sunny  24  cse
3    Priya  26   it

In [5]:
type(d)

pandas.core.frame.DataFrame

In [7]:
dir(pd)

['ArrowDtype',
 'BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt8Dtype',
 '__all__',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_built_with_meson',
 '_config',
 '_is_numpy_dev',
 '_libs',
 '_pandas_datetime_CAPI',
 '_pandas_parser_CAPI',
 '_testing',
 '_typing',
 '_version_meson',
 'annotations',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'from_dummies',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'read_xml',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']